;Place localized text in this file
[DarkEvent_HighAlert X2DarkEventTemplate]
DisplayName="ADVENT High Alert"
SummaryText="ADVENT becomes aware of your sneaky behavior, giving you 50% less time to complete concealed missions."
QuoteText="\"Looks like they've started to grow impatient with us, Commander. Tread carefully.\""
QuoteTextAuthor="- Central Officer Bradford"
PreMissionText="Lowers the time to complete missions out of concealment"
PostMissionSuccessText="Dark Event Countered: ADVENT High Alert"
PostMissionFailureText="Failed to Counter Dark Event: ADVENT High Alert"